Repository: EBAS-TECH/fuel-station-mobile
Catalog: lib/l10n/app_*.arb
Languages: am

# loginTitle
source: Login
am: ግባ

# loginSubtitle
source: Enter your email and password to sign in
am: ለመግባት ኢሜል እና የይለፍ ቃል ይግቡ

# usernameLabel
source: Username
am: የተጠቃሚ ስም

# usernameError
source: Username is required
am: የተጠቃሚ ስም ያስፈልጋል

# passwordLabel
source: Password
am: የይለፍ ቃል

# passwordErrorEmpty
source: Password field must be filled
am: የይለፍ ቃል መሞላት አለበት

# passwordErrorLength
source: Password must be at least 8 characters long
am: የይለፍ ቃል ቢያንስ 8 ቁምፊዎች ሊኖሩት ይገባል

source: Forgot password?
am: የይለፍ ቃል ረሳኽው?

# loginButton
source: SIGN IN
am: ግባ

# notRegistered
source: Not registered yet?
am: አልተመዘገብክም?

source: Register
am: ይመዝገቡ

# registerTitle
source: Create Account
am: መለያ ይፍጠሩ

# registerSubtitle
source: Enter your email and create a password to sign up
am: ለመመዝገብ ኢሜል እና የይለፍ ቃል ያስገቡ

# firstNameLabel
source: First Name
am: የመጀመሪያ ስም

# firstNameError
source: First name is required
am: የመጀመሪያ ስም ያስፈልጋል

# lastNameLabel
source: Last Name
am: የአባት ስም

# lastNameError
source: Last name is required
am: የአባት ስም ያስፈልጋል

# usernameErrorLength
source: Username must be at least 4 characters
am: የተጠቃሚ ስም ቢያንስ 4 ቁምፊ ሊኖረው ይገባል

# emailLabel
source: Email
am: ኢሜል

# emailError
source: Email is required
am: ኢሜል ያስፈልጋል

# emailInvalid
source: Invalid email format
am: ልክ ያልሆነ የኢሜል ቅርጸት

# confirmPasswordLabel
source: Confirm Password
am: የይለፍ ቃል ያረጋግጡ

# confirmPasswordError
source: Passwords do not match
am: የይለፍ ቃሎች አንድ አይነት አይደሉም

# registerButton
source: SIGN UP
am: ይመዝገቡ

# alreadyHaveAccount
source: Already have an account?
am: ቀድሞ መለያ አለህ?

source: Login
am: ግባ

# verifyEmailTitle
source: Verify Your Email
am: ኢሜልዎን ያረጋግጡ

# verificationCodeSent
source: We've sent a 6-digit verification code to
am: 6-አሃዝ የማረጋገጫ ኮድ ወደ ዚህ ኢሜል ላክን

# enterVerificationCode
source: Please enter the verification code
am: እባክዎ የማረጋገጫ ኮዱን ያስገቡ

source: Verify Account
am: መለያ ያረጋግጡ

# didNotReceiveCode
source: Didn't receive a code?
am: ኮድ አልደረሰዎትም?

source: Resend
am: እንደገና ላክ

source: Resend in
am: በ

source: Back to registration
am: ወደ ምዝገባ ተመለስ

# invalidCode
source: Invalid verification code
am: ልክ ያልሆነ ማረጋገጫ ኮድ

source: Back to login
am: ወደ ግባ ተመለስ

source: Gas Station
am: የነዳጅ ጣቢያ

source: No fuel info
am: የነዳጅ መረጃ የለም

source: Loading...
am: በመጫን ላይ...

source: Distance
am: ርቀት

source: Duration
am: ጊዜ

source: available
am: ይገኛል

source: Show route
am: መንገድ አሳይ

# moreDetails
source: Station details
am: ተጨማሪ ዝርዝሮች

source: Nearby Gas Stations
am: አቅራቢ የነዳጅ ጣቢያዎች

source: All
am: ሁሉም

source: Petrol
am: ፔትሮል

source: Diesel
am: ዲዘል

source: No stations found
am: ምንም ጣቢያ አልተገኘም

source: Suggested
am: የተመከረ

# suggestionTooltip
source: This suggestion is made based on the station's ratings and user votes
am: ይህ ምክር በጣቢያው ደረጃ እና በተጠቃሚ ድምጽ ላይ የተመሠረተ ነው

# locationPermissionRequired
source: Location permission is required to access your location
am: አካባቢዎን ለመድረስ የቦታ ፈቃድ ያስፈልጋል

source: Hey There
am: ሰላም

source: Log Out
am: ውጣ

# logOutConfirmation
source: Are you sure you want to log out of your account?
am: ከመለያዎ መውጣት ይፈልጋሉ?

source: Cancel
am: ሰርዝ

source: My Profile
am: የእኔ መገለጫ

source: Username
am: የተጠቃሚ ስም

source: Member Since
am: ከዚህ ጊዜ ጀምሮ አባል

source: Account Status
am: የመለያ ሁኔታ

source: Verified
am: የተረጋገጠ

source: Not Verified
am: አልተረጋገጠም

source: Not provided
am: አልተሰጠም

# unknown
source: An error occurred. Please try again
am: ስህተት ተከስቷል። እባክዎ እንደገና ይሞክሩ

source: Error loading profile
am: መገለጫ በማጫን ላይ ስህተት

source: Try Again
am: እንደገና ይሞክሩ

source: Not Rated
am: አልተመደበም

source: Home
am: መነሻ

source: Favorite
am: ተወዳጅ

source: Price
am: ዋጋ

source: Profile
am: መገለጫ

# favoritesTitle
source: Favorites
am: ተወዳጅ የነዳጅ ጣቢያዎች

source: Remove Favorite
am: ተወዳጅ ያስወግዱ

# removeFavoriteConfirmation
source: Are you sure you want to remove {stationName} from favorites?
am: እርግጠኛ ነህ {stationName} ከተወዳጆች ማስወገድ ትፈልጋለህ?

source: Remove
am: አስወግድ

source: No Favorites yet
am: እስካሁን ምንም ተወዳጅ የለም

# addFavoritesHint
source: Tap the heart icon on a gas station to favorite it
am: ጣቢያውን ለመውደድ የልብ አዶ ይጫኑ

source: Error loading favorites
am: ተወዳጆችን በማጫን ላይ ስህተት

source: Retry
am: እንደገና ይሞክሩ

source: Address
am: አድራሻ

source: No fuel
am: ነዳጅ የለም

source: Average Rating
am: አማካኝ ደረጃ

# verifyEmailTitleUnverified
source: Email not verified
am: ኢሜል አልተረጋገጠም

# mustVerifyEmail
source: You must verify your email to use our app
am: አፕሊኬሽንን ለመጠቀም ኢሜልዎን ማረጋገጥ አለብዎት

# stationDetailsTitle
source: Fuel Station Details
am: የነዳጅ ጣቢያ ዝርዝሮች

# yourRatingLabel
source: Your Rating
am: የእርስዎ ደረጃ

# ratedMessage
source: You rated this station
am: ይህን ጣቢያ ደረጃ ሰጥተዋል

# yourCommentLabel
source: Your Comment
am: የእርስዎ አስተያየት

# commentHint
source: Share your experience...
am: ልምድዎን ያካፍሉ...

# editButton
source: Edit
am: አርም

# updateButton
source: Update
am: አዘምን

# submitButton
source: Submit
am: አስገባ

# updateFeedbackTitle
source: Update Feedback
am: አስተያየት አረጋግጥ

# submitFeedbackTitle
source: Submit Feedback
am: አስተያየት አስገባ

# updateFeedbackConfirmation
source: Are you sure you want to update your feedback?
am: አስተያየትዎን ለመሻሻል እርግጠኛ ነዎት?

# submitFeedbackConfirmation
source: Are you sure you want to submit your feedback?
am: አስተያየትዎን ለመላክ እርግጠኛ ነዎት?

# feedbackEmptyError
source: Please provide a rating or comment
am: እባክዎ ደረጃ ወይም አስተያየት ይስጡ

source: Confirm
am: አረጋግጥ

# distanceUnit
source: km
am: ኪ.ሜ

# suggestedBadge
source: Suggested
am: የተመከረ

# kmAway
source: {distance} km
am: {distance} ኪ.ሜ

# fuelTypes
source: Fuel types: {types}
am: የነዳጅ አይነቶች: {types}

source: No fuel information
am: የነዳጅ መረጃ የለም

# feedbackConfirmation
source: Are you sure you want to {action} your feedback?
am: እርግጠኛ ነህ/ነሽ የእርስዎን አስተያየት ለመ{action}?

# fuelPricesTitle
source: Fuel Prices
am: የነዳጅ ዋጋዎች

# pricePerLiter
source: {price}Br/L
am: {price}ብር/ሊትር

source: Since
am: ከ

source: Effective until
am: የሚተገበር እስከ

source: Source
am: ምንጭ

# ministryOfMines
source: Ministry of Mines and Petroleum
am: የማዕድን እና የነዳጅ ሚኒስቴር

# noPriceData
source: No fuel price data
am: የነዳጅ ዋጋ መረጃ የለም

# errorLoadingPrices
source: Error loading fuel prices
am: የነዳጅ ዋጋዎችን በማጫን ላይ ስህተት

# editProfileTitle
source: Edit Profile
am: መገለጫ አርም

source: Profile Information
am: የመገለጫ መረጃ

source: Change Password
am: የይለፍ ቃል ቀይር

source: Current Password
am: አሁን ያለው የይለፍ ቃል

source: New Password
am: አዲስ የይለፍ ቃል

source: Confirm New Password
am: አዲሱን የይለፍ ቃል ያረጋግጡ

# passwordRequirement
source: Password must be at least 6 characters long
am: የይለፍ ቃል ቢያንስ 6 ቁምፊ ሊኖረው ይገባል

source: SAVE CHANGES
am: ለውጦችን አስቀምጥ

# profileUpdateSuccess
source: Profile updated successfully
am: መገለጫ በተሳካ ሁኔታ ተሻሽሏል

# passwordChangeSuccess
source: Password changed successfully
am: የይለፍ ቃል በተሳካ ሁኔታ ተቀይሯል

# fillAllFields
source: Please fill all fields
am: እባክዎ ሁሉንም መስኮች ይሙሉ

# passwordsDontMatch
source: Passwords do not match
am: የይለፍ ቃሎች አንድ አይነት አይደሉም

# passwordTooShort
source: Password must be at least 6 characters long
am: የይለፍ ቃል ቢያንስ 6 ቁምፊ ሊኖረው ይገባል

# forgotPasswordTitle
source: Forgot Password
am: የይለፍ ቃል ረሳኽው

# forgotPasswordSubtitle
source: Enter your email to receive a password reset code
am: የይለፍ ቃል ዳግም ለማስጀመር ኢሜልዎን ያስገቡ

# sendCodeButton
source: SEND CODE
am: ኮድ ላክ

# resetPasswordTitle
source: Reset Password
am: የይለፍ ቃል ዳግም ያስጀምሩ

# resetPasswordSubtitle
source: Enter the code sent to your email and set a new password
am: ወደ ኢሜልዎ የተላከውን ኮድ እና አዲስ የይለፍ ቃል ያስገቡ

# newPasswordLabel
source: New Password
am: አዲስ የይለፍ ቃል

# confirmNewPasswordLabel
source: Confirm New Password
am: አዲሱን የይለፍ ቃል ያረጋግጡ

# resetPasswordButton
source: RESET PASSWORD
am: የይለፍ ቃል ዳግም ያስጀምሩ

# codeVerificationTitle
source: Code Verification
am: የኮድ ማረጋገጫ

# codeVerificationSubtitle
source: Enter the 6-digit code sent to your email
am: ወደ ኢሜልዎ የተላከውን 6-አሃዝ ኮድ ያስገቡ

# codeVerificationError
source: Incorrect verifcation code
am: የይለፍ ቃሎች አንድ አይነት አይደሉም

# verifyButton
source: Verify
am: ያረጋግጡ

# signup
source: Registration successful
am: ምዝገባ ተሳክቷል

# signin
source: Login successful
am: ግባት ተሳክቷል

# verifyEmail
source: Email verification successful. Please login
am: ኢሜል ማረጋገጫ ተሳክቷል። እባክዎ ይግቡ

# logout
source: Logout successful
am: ውጣት ተሳክቷል

# resendCode
source: Verification code resent
am: ማረጋገጫ ኮድ በድጋሚ ተልኳል

# forgotVerify
source: Code verified. Set a new password
am: ኮድ ተረጋግጧል። አዲስ የይለፍ ቃል ያስገቡ

# setNewPassword
source: Password updated successfully. Please login
am: የይለፍ ቃል ተሻሽሏል። እባክዎ ይግቡ

# profileUpdate
source: Profile updated successfully
am: መገለጫ ተሻሽሏል

# passwordChange
source: Password changed successfully
am: የይለፍ ቃል ተቀይሯል

# conflict
source: User already exists
am: ተጠቃሚ አስቀድሞ አለ

# unauthorized
source: Invalid credentials
am: ልክ ያልሆነ የግብይት ማስረጃ

# notFound
source: User not found
am: ተጠቃሚ አልተገኘም

# serverError
source: Server error. Please try again
am: የሰርቨር ስህተት። እባክዎ እንደገና ይሞክሩ

# noInternet
source: No internet connection
am: የኢንተርኔት ግንኙነት የለም

# timeout
source: Request timed out
am: ጥያቄው ጊዜ አልፎታል

source: Invalid input
am: ልክ ያልሆነ ግቤት

# passwordMismatch
source: Passwords do not match
am: የይለፍ ቃሎች አንድ አይነት አይደሉም

source: View nearby stations
am: አቅራቢ የነዳጅ ጣቢያዎችን ይመልከቱ

# locationNotLoaded
source: Please wait while we load your location
am: እባክዎ አካባቢዎን እየጫንን ሳለ ይጠብቁ

source: Change Profile Picture
am: የመገለጫ ፎቶ ቀይር

# imagePickerError
source: Failed to pick image
am: ፎቶ ማምረጥ አልተሳካም

# storagePermissionDenied
source: Storage permission is required to select images
am: ፎቶ ለመምረጥ የእቃ ቤት ፈቃድ ያስፈልጋል

# cameraPermissionDenied
source: Camera permission is required to take photos
am: ፎቶ ለመነሳት የካሜራ ፈቃድ ያስፈልጋል

# passwordErrorLetterNumberCombo
source: Must contain combination of letters and numbers
am: ፊደል እና ቁጥር በቅልቅል ሊኖረው ይገባል

# passwordErrorTooCommon
source: This password is too common and insecure
am: ይህ በጣም የተለመደ እና ደህንነቱ የተጋለጠ ነው

# passwordErrorUppercase
source: Must contain at least one uppercase letter
am: ቢያንስ አንድ አቢይ ፊደል ሊኖረው ይገባል

# passwordErrorLowercase
source: Must contain at least one lowercase letter
am: ቢያንስ አንድ ትንሽ ፊደል ሊኖረው ይገባል

# passwordErrorNumber
source: Must contain at least one number
am: ቢያንስ አንድ ቁጥር ሊኖረው ይገባል

# passwordErrorSpecialChar
source: Must contain at least one special character
am: ቢያንስ አንድ ልዩ ምልክት ሊኖረው ይገባል
